Revit 2027 API
ElementIntersectsSolidFilter Constructor
Overload List
Name | Description
ElementIntersectsSolidFilter(Solid) |  Constructs a filter to match elements which intersect the given element.
ElementIntersectsSolidFilter(Solid, Boolean) |  Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element.
Top
See Also
Reference
ElementIntersectsSolidFilter Class
Autodesk.Revit.DB Namespace